In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

In [2]:
import getpass  # To get the password without showing the input

In [3]:
password = getpass.getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

1. How many distinct (different) actors' last names are there?

In [5]:
query = """select count(distinct last_name) as "count_distinct_last_names"
from actor"""

count_distinct_last_name = pd.read_sql_query(query, engine)
count_distinct_last_name

   count_distinct_last_names
0                        121

2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [6]:
query = """select rental_id, rental_date, CASE 
WHEN dayname(rental_date) IN ('Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday')
Then 'workday'
ELSE 'weekend'
END AS 'day_type'
from rental"""

weekday = pd.read_sql_query(query, engine)
weekday

       rental_id         rental_date day_type
0              1 2005-05-24 22:53:30  workday
1              2 2005-05-24 22:54:33  workday
2              3 2005-05-24 23:03:39  workday
3              4 2005-05-24 23:04:41  workday
4              5 2005-05-24 23:05:21  workday
...          ...                 ...      ...
16039      13486 2006-02-14 15:16:03  workday
16040      15966 2006-02-14 15:16:03  workday
16041      11676 2006-02-14 15:16:03  workday
16042      14616 2006-02-14 15:16:03  workday
16043      11739 2006-02-14 15:16:03  workday

[16044 rows x 3 columns]

3. Get all films with ARMAGEDDON in the title.

In [8]:
query = """   
select title from film 
where title REGEXP 'ARMAGEDDON' 
"""
ARMAGEDDON = pd.read_sql(query, engine) 
ARMAGEDDON

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

4. Get 10 the longest films.

In [15]:
query = """
select film_id, title, length from film 
ORDER by length DESC
LIMIT 10
"""

longst_10_films = pd.read_sql(query, engine)
longst_10_films

   film_id               title  length
0      212      DARN FORRESTER     185
1      690        POND SEATTLE     185
2      141       CHICAGO NORTH     185
3      609       MUSCLE BRIGHT     185
4      991        WORST BANGER     185
5      349         GANGS PRIDE     185
6      817  SOLDIERS EVOLUTION     185
7      426           HOME PITY     185
8      872   SWEET BROTHERHOOD     185
9      182      CONTROL ANTHEM     185

5. How many films include Behind the Scenes content?

In [18]:
query = """
SELECT count(special_features) as number_of_film_BTS FROM film 
WHERE special_features REGEXP 'Behind the Scenes'
"""
number_of_film_bts = pd.read_sql(query, engine)
number_of_film_bts

   number_of_film_BTS
0                 538

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [19]:
query = """
select rating, avg(length) from film
group by rating
having avg(length) > 120;
"""

film_over_2hours = pd.read_sql(query, engine)
film_over_2hours

  rating  avg(length)
0  PG-13     120.4439

Rank films by length (filter out the rows that have nulls or 0s in length column). 
In your output, only select the columns title, length, and the rank.

In [20]:
query = """
SELECT Rank() OVER(ORDER BY length DESC) AS 'rank', title, length FROM film
WHERE length IS NOT NULL AND length > 0
"""
rank_long_films = pd.read_sql(query, engine)
rank_long_films

     rank                title  length
0       1        CHICAGO NORTH     185
1       1       CONTROL ANTHEM     185
2       1       DARN FORRESTER     185
3       1          GANGS PRIDE     185
4       1            HOME PITY     185
..    ...                  ...     ...
995   996         ALIEN CENTER      46
996   996            IRON MOON      46
997   996        KWAI HOMEWARD      46
998   996     LABYRINTH LEAGUE      46
999   996  RIDGEMONT SUBMARINE      46

[1000 rows x 3 columns]